2) /var/www/html/src/Core/Domain/Actor/Event/ActorWasCreated.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->aggregateNameFromClassname(Actor::class);
     }
-    public function actorId() : string
+    protected function actorId() : string
     {
         return $this->actorId;
     }

3) /var/www/html/src/Core/Domain/Actor/Event/ActorWasCreated.php:66    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function setupPayload() : void
     {
         $payload = $this->messagePayload();
-        Assert::that($payload)->keyExists('actorId');
+        
         Assert::that($payload['actorId'])->string();
         $this->actorId = $payload['actorId'];
         Assert::that($payload)->keyExists('name');

4) /var/www/html/src/Core/Domain/Actor/Event/ActorWasCreated.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $payload = $this->messagePayload();
         Assert::that($payload)->keyExists('actorId');
-        Assert::that($payload['actorId'])->string();
+        
         $this->actorId = $payload['actorId'];
         Assert::that($payload)->keyExists('name');
         Assert::that($payload['name'])->string();

5) /var/www/html/src/Core/Domain/Actor/Event/ActorWasCreated.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload)->keyExists('actorId');
         Assert::that($payload['actorId'])->string();
         $this->actorId = $payload['actorId'];
-        Assert::that($payload)->keyExists('name');
+        
         Assert::that($payload['name'])->string();
         $this->name = $payload['name'];
         Assert::that($payload)->keyExists('internalId');

6) /var/www/html/src/Core/Domain/Actor/Event/ActorWasCreated.php:71    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload['actorId'])->string();
         $this->actorId = $payload['actorId'];
         Assert::that($payload)->keyExists('name');
-        Assert::that($payload['name'])->string();
+        
         $this->name = $payload['name'];
         Assert::that($payload)->keyExists('internalId');
         Assert::that($payload['internalId'])->string();

7) /var/www/html/src/Core/Domain/Actor/Event/ActorWasCreated.php:74    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload)->keyExists('name');
         Assert::that($payload['name'])->string();
         $this->name = $payload['name'];
-        Assert::that($payload)->keyExists('internalId');
+        
         Assert::that($payload['internalId'])->string();
         $this->internalId = $payload['internalId'];
     }
 }

8) /var/www/html/src/Core/Domain/Actor/Event/ActorWasCreated.php:75    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload['name'])->string();
         $this->name = $payload['name'];
         Assert::that($payload)->keyExists('internalId');
-        Assert::that($payload['internalId'])->string();
+        
         $this->internalId = $payload['internalId'];
     }
 }

9) /var/www/html/src/Core/Domain/Actor/ValueObject/ActorId.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::true(1 === preg_match("/^nm\\d{7}\$/i", $value), 'The actor Id must start with nm followed by 7 numbers');
+        
         $this->value = $value;
     }
 }

10) /var/www/html/src/Core/Domain/Actor/ValueObject/ActorId.php:55    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::true(1 === preg_match("/^nm\\d{7}\$/i", $value), 'The actor Id must start with nm followed by 7 numbers');
+        Assertion::true(1 === preg_match("/nm\\d{7}\$/i", $value), 'The actor Id must start with nm followed by 7 numbers');
         $this->value = $value;
     }
 }

11) /var/www/html/src/Core/Domain/Actor/ValueObject/ActorId.php:55    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::true(1 === preg_match("/^nm\\d{7}\$/i", $value), 'The actor Id must start with nm followed by 7 numbers');
+        Assertion::true(1 === preg_match("/^nm\\d{7}/i", $value), 'The actor Id must start with nm followed by 7 numbers');
         $this->value = $value;
     }
 }

12) /var/www/html/src/Core/Domain/Actor/ValueObject/ActorId.php:55    [M] PregMatchRemoveFlags

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::true(1 === preg_match("/^nm\\d{7}\$/i", $value), 'The actor Id must start with nm followed by 7 numbers');
+        Assertion::true(1 === preg_match("/^nm\\d{7}\$/", $value), 'The actor Id must start with nm followed by 7 numbers');
         $this->value = $value;
     }
 }

13) /var/www/html/src/Core/Domain/Actor/ValueObject/SeasonsActive.php:18    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public static function fromArray(array $seasonsActive) : self
     {
         $value = json_encode($seasonsActive);
-        Assertion::string($value);
+        
         return new self($value);
     }
     public function value() : string

14) /var/www/html/src/Core/Domain/Character/Event/CharacterWasCreated.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->aggregateNameFromClassname(Character::class);
     }
-    public function characterId() : string
+    protected function characterId() : string
     {
         return $this->characterId;
     }

15) /var/www/html/src/Core/Domain/Character/Event/CharacterWasCreated.php:66    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function setupPayload() : void
     {
         $payload = $this->messagePayload();
-        Assert::that($payload)->keyExists('characterId');
+        
         Assert::that($payload['characterId'])->string();
         $this->characterId = $payload['characterId'];
         Assert::that($payload)->keyExists('name');

16) /var/www/html/src/Core/Domain/Character/Event/CharacterWasCreated.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $payload = $this->messagePayload();
         Assert::that($payload)->keyExists('characterId');
-        Assert::that($payload['characterId'])->string();
+        
         $this->characterId = $payload['characterId'];
         Assert::that($payload)->keyExists('name');
         Assert::that($payload['name'])->string();

17) /var/www/html/src/Core/Domain/Character/Event/CharacterWasCreated.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload)->keyExists('characterId');
         Assert::that($payload['characterId'])->string();
         $this->characterId = $payload['characterId'];
-        Assert::that($payload)->keyExists('name');
+        
         Assert::that($payload['name'])->string();
         $this->name = $payload['name'];
         Assert::that($payload)->keyExists('internalId');

21) /var/www/html/src/Core/Domain/Character/Service/CharacterCreator.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->characters->save($character);
         foreach ($actors->collection() as $actor) {
             $actor->assignCharacter($character);
-            $this->actors->save($actor);
+            
         }
     }
     /** @throws CharacterAlreadyExistsException */

22) /var/www/html/src/Core/Domain/Character/ValueObject/CharacterId.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::true(1 === preg_match("/^ch\\d{7}\$/i", $value), 'The character Id must start with ch followed by 7 numbers');
+        
         $this->value = $value;
     }
 }

23) /var/www/html/src/Core/Domain/Character/ValueObject/CharacterId.php:55    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::true(1 === preg_match("/^ch\\d{7}\$/i", $value), 'The character Id must start with ch followed by 7 numbers');
+        Assertion::true(1 === preg_match("/ch\\d{7}\$/i", $value), 'The character Id must start with ch followed by 7 numbers');
         $this->value = $value;
     }
 }

24) /var/www/html/src/Core/Domain/Character/ValueObject/CharacterId.php:55    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::true(1 === preg_match("/^ch\\d{7}\$/i", $value), 'The character Id must start with ch followed by 7 numbers');
+        Assertion::true(1 === preg_match("/^ch\\d{7}/i", $value), 'The character Id must start with ch followed by 7 numbers');
         $this->value = $value;
     }
 }

25) /var/www/html/src/Core/Domain/Character/ValueObject/CharacterId.php:55    [M] PregMatchRemoveFlags

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::true(1 === preg_match("/^ch\\d{7}\$/i", $value), 'The character Id must start with ch followed by 7 numbers');
+        Assertion::true(1 === preg_match("/^ch\\d{7}\$/", $value), 'The character Id must start with ch followed by 7 numbers');
         $this->value = $value;
     }
 }

26) /var/www/html/src/Core/Domain/CharacterRelate/Event/CharacterWasRelated.php:53    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->aggregateNameFromClassname(CharacterRelate::class);
     }
-    public function relationId() : string
+    protected function relationId() : string
     {
         return $this->relationId;
     }

27) /var/www/html/src/Core/Domain/CharacterRelate/Event/CharacterWasRelated.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function setupPayload() : void
     {
         $payload = $this->messagePayload();
-        Assert::that($payload)->keyExists('relationId');
+        
         Assert::that($payload['relationId'])->string();
         $this->relationId = $payload['relationId'];
         Assert::that($payload)->keyExists('characterId');

28) /var/www/html/src/Core/Domain/CharacterRelate/Event/CharacterWasRelated.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $payload = $this->messagePayload();
         Assert::that($payload)->keyExists('relationId');
-        Assert::that($payload['relationId'])->string();
+        
         $this->relationId = $payload['relationId'];
         Assert::that($payload)->keyExists('characterId');
         Assert::that($payload['characterId'])->string();

29) /var/www/html/src/Core/Domain/CharacterRelate/Event/CharacterWasRelated.php:81    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload)->keyExists('relationId');
         Assert::that($payload['relationId'])->string();
         $this->relationId = $payload['relationId'];
-        Assert::that($payload)->keyExists('characterId');
+        
         Assert::that($payload['characterId'])->string();
         $this->characterId = $payload['characterId'];
         Assert::that($payload)->keyExists('relatedTo');

31) /var/www/html/src/Core/Domain/CharacterRelate/Event/CharacterWasRelated.php:85    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload)->keyExists('characterId');
         Assert::that($payload['characterId'])->string();
         $this->characterId = $payload['characterId'];
-        Assert::that($payload)->keyExists('relatedTo');
+        
         Assert::that($payload['relatedTo'])->string();
         $this->relatedTo = $payload['relatedTo'];
         Assert::that($payload)->keyExists('relation');

32) /var/www/html/src/Core/Domain/CharacterRelate/Event/CharacterWasRelated.php:86    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload['characterId'])->string();
         $this->characterId = $payload['characterId'];
         Assert::that($payload)->keyExists('relatedTo');
-        Assert::that($payload['relatedTo'])->string();
+        
         $this->relatedTo = $payload['relatedTo'];
         Assert::that($payload)->keyExists('relation');
         Assert::that($payload['relation'])->string();

33) /var/www/html/src/Core/Domain/CharacterRelate/Event/CharacterWasRelated.php:89    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload)->keyExists('relatedTo');
         Assert::that($payload['relatedTo'])->string();
         $this->relatedTo = $payload['relatedTo'];
-        Assert::that($payload)->keyExists('relation');
+        
         Assert::that($payload['relation'])->string();
         $this->relation = $payload['relation'];
     }
 }

34) /var/www/html/src/Core/Domain/CharacterRelate/Event/CharacterWasRelated.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload['relatedTo'])->string();
         $this->relatedTo = $payload['relatedTo'];
         Assert::that($payload)->keyExists('relation');
-        Assert::that($payload['relation'])->string();
+        
         $this->relation = $payload['relation'];
     }
 }

49) /var/www/html/src/Core/Domain/House/Event/HouseWasCreated.php:45    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->aggregateNameFromClassname(House::class);
     }
-    public function houseId() : string
+    protected function houseId() : string
     {
         return $this->houseId;
     }

50) /var/www/html/src/Core/Domain/House/Event/HouseWasCreated.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function setupPayload() : void
     {
         $payload = $this->messagePayload();
-        Assert::that($payload)->keyExists('houseId');
+        
         Assert::that($payload['houseId'])->string();
         $this->houseId = $payload['houseId'];
         Assert::that($payload)->keyExists('name');

51) /var/www/html/src/Core/Domain/House/Event/HouseWasCreated.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $payload = $this->messagePayload();
         Assert::that($payload)->keyExists('houseId');
-        Assert::that($payload['houseId'])->string();
+        
         $this->houseId = $payload['houseId'];
         Assert::that($payload)->keyExists('name');
         Assert::that($payload['name'])->string();

52) /var/www/html/src/Core/Domain/House/Event/HouseWasCreated.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::that($payload)->keyExists('houseId');
         Assert::that($payload['houseId'])->string();
         $this->houseId = $payload['houseId'];
-        Assert::that($payload)->keyExists('name');
+        
         Assert::that($payload['name'])->string();
         $this->name = $payload['name'];
     }
 }

59) /var/www/html/src/Core/Domain/House/Service/HouseUpdater.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $house = $this->finder->ofIdOrFail($houseId);
         $house->update($name);
-        $this->houses->save($house);
+        
     }
 }


Timed Out mutants:
==================

1) /var/www/html/src/Shared/Application/Command/AsyncCommand.php:19    [M] CastString

--- Original
+++ New
@@ @@
     }
     public static final function messageAction() : string
     {
-        return (string) Str::of(class_basename(static::class))->snake()->replaceLast('_command', '');
+        return Str::of(class_basename(static::class))->snake()->replaceLast('_command', '');
     }
 }

2) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:20    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private readonly array $results, private readonly int $numberOfResults, private readonly PaginatorPage $pageNumber, private readonly PaginatorSize $pageSize)
     {
     }
-    public function results() : array
+    protected function results() : array
     {
         return $this->results;
     }

3) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->results;
     }
-    public function currentPage() : int
+    protected function currentPage() : int
     {
         return $this->pageNumber->value();
     }

4) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->pageNumber->value();
     }
-    public function lastPage() : int
+    protected function lastPage() : int
     {
         try {
             $numberOfPages = (int) ceil($this->total() / $this->size());

5) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:33    [M] Division

--- Original
+++ New
@@ @@
     public function lastPage() : int
     {
         try {
-            $numberOfPages = (int) ceil($this->total() / $this->size());
+            $numberOfPages = (int) ceil($this->total() * $this->size());
         } catch (\Throwable) {
             $numberOfPages = 0;
         }

6) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:33    [M] RoundingFamily

--- Original
+++ New
@@ @@
     public function lastPage() : int
     {
         try {
-            $numberOfPages = (int) ceil($this->total() / $this->size());
+            $numberOfPages = (int) floor($this->total() / $this->size());
         } catch (\Throwable) {
             $numberOfPages = 0;
         }

7) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:33    [M] RoundingFamily

--- Original
+++ New
@@ @@
     public function lastPage() : int
     {
         try {
-            $numberOfPages = (int) ceil($this->total() / $this->size());
+            $numberOfPages = (int) round($this->total() / $this->size());
         } catch (\Throwable) {
             $numberOfPages = 0;
         }

8) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:33    [M] CastInt

--- Original
+++ New
@@ @@
     public function lastPage() : int
     {
         try {
-            $numberOfPages = (int) ceil($this->total() / $this->size());
+            $numberOfPages = ceil($this->total() / $this->size());
         } catch (\Throwable) {
             $numberOfPages = 0;
         }

9) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:35    [M] DecrementInteger

--- Original
+++ New
@@ @@
         try {
             $numberOfPages = (int) ceil($this->total() / $this->size());
         } catch (\Throwable) {
-            $numberOfPages = 0;
+            $numberOfPages = -1;
         }
         return $numberOfPages;
     }

10) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $numberOfPages;
     }
-    public function size() : int
+    protected function size() : int
     {
         return $this->pageSize->value();
     }

11) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->pageSize->value();
     }
-    public function total() : int
+    protected function total() : int
     {
         return $this->numberOfResults;
     }

12) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:52    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
         return $this->numberOfResults;
     }
     /** @return array<string, mixed> */
-    protected function meta() : array
+    private function meta() : array
     {
         return ['currentPage' => $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
     }
 }

13) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:54    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     /** @return array<string, mixed> */
     protected function meta() : array
     {
-        return ['currentPage' => $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
+        return ['lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
     }
 }

14) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:55    [M] ArrayItem

--- Original
+++ New
@@ @@
     /** @return array<string, mixed> */
     protected function meta() : array
     {
-        return ['currentPage' => $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
+        return ['currentPage' > $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
     }
 }

15) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:56    [M] ArrayItem

--- Original
+++ New
@@ @@
     /** @return array<string, mixed> */
     protected function meta() : array
     {
-        return ['currentPage' => $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
+        return ['currentPage' => $this->currentPage(), 'lastPage' > $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
     }
 }

16) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:57    [M] ArrayItem

--- Original
+++ New
@@ @@
     /** @return array<string, mixed> */
     protected function meta() : array
     {
-        return ['currentPage' => $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
+        return ['currentPage' => $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' > $this->size(), 'total' => $this->total()];
     }
 }

17) /var/www/html/src/Shared/Application/Query/PaginatorResponse.php:58    [M] ArrayItem

--- Original
+++ New
@@ @@
     /** @return array<string, mixed> */
     protected function meta() : array
     {
-        return ['currentPage' => $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' => $this->total()];
+        return ['currentPage' => $this->currentPage(), 'lastPage' => $this->lastPage(), 'size' => $this->size(), 'total' > $this->total()];
     }
 }

18) /var/www/html/src/Shared/Domain/Aggregate/AggregateRoot.php:16    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private int $aggregateVersion = 0;
     /** @var array<DomainEvent> */
     private array $events = [];
-    public final function aggregateVersion() : int
+    protected final function aggregateVersion() : int
     {
         return $this->aggregateVersion;
     }

19) /var/www/html/src/Shared/Domain/Aggregate/AggregateRoot.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->aggregateVersion;
     }
     /** @return array<DomainEvent> */
-    public final function events() : array
+    protected final function events() : array
     {
         return $this->events;
     }

20) /var/www/html/src/Shared/Domain/Aggregate/AggregateRoot.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->events;
     }
-    public final function reset() : void
+    protected final function reset() : void
     {
         $this->events = [];
         $this->aggregateVersion = 0;

21) /var/www/html/src/Shared/Domain/Aggregate/AggregateRoot.php:30    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public final function reset() : void
     {
         $this->events = [];
-        $this->aggregateVersion = 0;
+        $this->aggregateVersion = -1;
     }
     protected final function recordThat(DomainEvent $event) : void
     {

22) /var/www/html/src/Shared/Domain/Aggregate/AggregateRoot.php:36    [M] Increment

--- Original
+++ New
@@ @@
     protected final function recordThat(DomainEvent $event) : void
     {
         $this->events[] = $event;
-        ++$this->aggregateVersion;
+        --$this->aggregateVersion;
     }
 }

23) /var/www/html/src/Shared/Domain/Data/DataMapping.php:20    [M] LogicalNot

--- Original
+++ New
@@ @@
      */
     private static function getArray(array $data, string $key) : ?array
     {
-        if (!array_key_exists($key, $data)) {
+        if (array_key_exists($key, $data)) {
             return null;
         }
         $value = $data[$key];

24) /var/www/html/src/Shared/Domain/Data/DataMapping.php:26    [M] LogicalNot

--- Original
+++ New
@@ @@
             return null;
         }
         $value = $data[$key];
-        return !\is_array($value) ? null : $value;
+        return \is_array($value) ? null : $value;
     }
     /* @param array<mixed> $data */
     private static function getBool(array $data, string $key, bool $default = false) : bool

25) /var/www/html/src/Shared/Domain/Data/DataMapping.php:26    [M] Ternary

--- Original
+++ New
@@ @@
             return null;
         }
         $value = $data[$key];
-        return !\is_array($value) ? null : $value;
+        return !\is_array($value) ? $value : null;
     }
     /* @param array<mixed> $data */
     private static function getBool(array $data, string $key, bool $default = false) : bool

26) /var/www/html/src/Shared/Domain/Data/DataMapping.php:32    [M] FalseValue

--- Original
+++ New
@@ @@
         return !\is_array($value) ? null : $value;
     }
     /* @param array<mixed> $data */
-    private static function getBool(array $data, string $key, bool $default = false) : bool
+    private static function getBool(array $data, string $key, bool $default = true) : bool
     {
         $value = self::getBoolOrNull($data, $key);
         if (null === $value) {

27) /var/www/html/src/Shared/Domain/Data/DataMapping.php:36    [M] Identical

--- Original
+++ New
@@ @@
     private static function getBool(array $data, string $key, bool $default = false) : bool
     {
         $value = self::getBoolOrNull($data, $key);
-        if (null === $value) {
+        if (null !== $value) {
             return $default;
         }
         return $value;

28) /var/www/html/src/Shared/Domain/Data/DataMapping.php:48    [M] Identical

--- Original
+++ New
@@ @@
     private static function getBoolOrNull(array $data, string $key) : ?bool
     {
         $value = Arr::get($data, $key);
-        if (null === $value) {
+        if (null !== $value) {
             return null;
         }
         return filter_var($value, \FILTER_VALIDATE_BOOLEAN, \FILTER_NULL_ON_FAILURE);

29) /var/www/html/src/Shared/Domain/Data/DataMapping.php:52    [M] FunctionCall

--- Original
+++ New
@@ @@
         if (null === $value) {
             return null;
         }
-        return filter_var($value, \FILTER_VALIDATE_BOOLEAN, \FILTER_NULL_ON_FAILURE);
+        filter_var($value, \FILTER_VALIDATE_BOOLEAN, \FILTER_NULL_ON_FAILURE);
+        return null;
     }
     /* @param array<mixed> $data */
     private static function getInt(array $data, string $key, int $default = 0) : int

30) /var/www/html/src/Shared/Domain/Data/DataMapping.php:56    [M] DecrementInteger

--- Original
+++ New
@@ @@
         return filter_var($value, \FILTER_VALIDATE_BOOLEAN, \FILTER_NULL_ON_FAILURE);
     }
     /* @param array<mixed> $data */
-    private static function getInt(array $data, string $key, int $default = 0) : int
+    private static function getInt(array $data, string $key, int $default = -1) : int
     {
         $value = self::getIntOrNull($data, $key);
         if (null === $value) {

31) /var/www/html/src/Shared/Domain/Data/DataMapping.php:56    [M] IncrementInteger

--- Original
+++ New
@@ @@
         return filter_var($value, \FILTER_VALIDATE_BOOLEAN, \FILTER_NULL_ON_FAILURE);
     }
     /* @param array<mixed> $data */
-    private static function getInt(array $data, string $key, int $default = 0) : int
+    private static function getInt(array $data, string $key, int $default = 1) : int
     {
         $value = self::getIntOrNull($data, $key);
         if (null === $value) {

32) /var/www/html/src/Shared/Domain/Data/DataMapping.php:60    [M] Identical

--- Original
+++ New
@@ @@
     private static function getInt(array $data, string $key, int $default = 0) : int
     {
         $value = self::getIntOrNull($data, $key);
-        if (null === $value) {
+        if (null !== $value) {
             return $default;
         }
         return $value;

34) /var/www/html/src/Shared/Domain/Data/DataMapping.php:77    [M] CastInt

--- Original
+++ New
@@ @@
             return null;
         }
         if (\is_bool($value)) {
-            return (int) $value;
+            return $value;
         }
         return filter_var($value, \FILTER_VALIDATE_INT, \FILTER_NULL_ON_FAILURE);
     }

35) /var/www/html/src/Shared/Domain/Data/DataMapping.php:80    [M] FunctionCall

--- Original
+++ New
@@ @@
         if (\is_bool($value)) {
             return (int) $value;
         }
-        return filter_var($value, \FILTER_VALIDATE_INT, \FILTER_NULL_ON_FAILURE);
+        filter_var($value, \FILTER_VALIDATE_INT, \FILTER_NULL_ON_FAILURE);
+        return null;
     }
     /** @throws AssertionFailedException */
     private static function generateId() : string

36) /var/www/html/src/Shared/Domain/Data/DataMapping.php:94    [M] LogicalNot

--- Original
+++ New
@@ @@
     private static function getString(array $data, string $key, string $default = '') : string
     {
         $value = Arr::get($data, $key);
-        if (!is_scalar($value)) {
+        if (is_scalar($value)) {
             return $default;
         }
         if (true === $value || false === $value) {
