37) /var/www/html/src/Shared/Domain/Data/DataMapping.php:98    [M] TrueValue

--- Original
+++ New
@@ @@
         if (!is_scalar($value)) {
             return $default;
         }
-        if (true === $value || false === $value) {
+        if (false === $value || false === $value) {
             return true === $value ? 'true' : 'false';
         }
         return (string) $value;

38) /var/www/html/src/Shared/Domain/Data/DataMapping.php:98    [M] Identical

--- Original
+++ New
@@ @@
         if (!is_scalar($value)) {
             return $default;
         }
-        if (true === $value || false === $value) {
+        if (true !== $value || false === $value) {
             return true === $value ? 'true' : 'false';
         }
         return (string) $value;

39) /var/www/html/src/Shared/Domain/Data/DataMapping.php:98    [M] FalseValue

--- Original
+++ New
@@ @@
         if (!is_scalar($value)) {
             return $default;
         }
-        if (true === $value || false === $value) {
+        if (true === $value || true === $value) {
             return true === $value ? 'true' : 'false';
         }
         return (string) $value;

40) /var/www/html/src/Shared/Domain/Data/DataMapping.php:98    [M] Identical

--- Original
+++ New
@@ @@
         if (!is_scalar($value)) {
             return $default;
         }
-        if (true === $value || false === $value) {
+        if (true === $value || false !== $value) {
             return true === $value ? 'true' : 'false';
         }
         return (string) $value;

41) /var/www/html/src/Shared/Domain/Data/DataMapping.php:99    [M] TrueValue

--- Original
+++ New
@@ @@
             return $default;
         }
         if (true === $value || false === $value) {
-            return true === $value ? 'true' : 'false';
+            return false === $value ? 'true' : 'false';
         }
         return (string) $value;
     }

42) /var/www/html/src/Shared/Domain/Data/DataMapping.php:99    [M] Identical

--- Original
+++ New
@@ @@
             return $default;
         }
         if (true === $value || false === $value) {
-            return true === $value ? 'true' : 'false';
+            return true !== $value ? 'true' : 'false';
         }
         return (string) $value;
     }

43) /var/www/html/src/Shared/Domain/Data/DataMapping.php:99    [M] Ternary

--- Original
+++ New
@@ @@
             return $default;
         }
         if (true === $value || false === $value) {
-            return true === $value ? 'true' : 'false';
+            return true === $value ? 'false' : 'true';
         }
         return (string) $value;
     }

44) /var/www/html/src/Shared/Domain/Data/DataMapping.php:104    [M] CastString

--- Original
+++ New
@@ @@
         if (true === $value || false === $value) {
             return true === $value ? 'true' : 'false';
         }
-        return (string) $value;
+        return $value;
     }
     /* @param array<mixed> $data */
     private static function getNonEmptyStringOrNull(array $data, string $key) : ?string

45) /var/www/html/src/Shared/Domain/Data/DataMapping.php:112    [M] Identical

--- Original
+++ New
@@ @@
     private static function getNonEmptyStringOrNull(array $data, string $key) : ?string
     {
         $value = self::getString($data, $key);
-        if ('' === $value) {
+        if ('' !== $value) {
             return null;
         }
         return $value;
     }
 }

46) /var/www/html/src/Shared/Domain/DomainException.php:12    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
 abstract class DomainException extends \Exception
 {
     /** @noinspection PhpAttributeCanBeAddedToOverriddenMemberInspection */
-    #[Pure]
-    protected function __construct(string $message, int $code = 0, ?\Throwable $previous = null)
+    private function __construct(string $message, int $code = 0, ?\Throwable $previous = null)
     {
         parent::__construct($message, $code, $previous);
     }

47) /var/www/html/src/Shared/Domain/DomainException.php:13    [M] DecrementInteger

--- Original
+++ New
@@ @@
 {
     /** @noinspection PhpAttributeCanBeAddedToOverriddenMemberInspection */
     #[Pure]
-    protected function __construct(string $message, int $code = 0, ?\Throwable $previous = null)
+    protected function __construct(string $message, int $code = -1, ?\Throwable $previous = null)
     {
         parent::__construct($message, $code, $previous);
     }

48) /var/www/html/src/Shared/Domain/DomainException.php:13    [M] IncrementInteger

--- Original
+++ New
@@ @@
 {
     /** @noinspection PhpAttributeCanBeAddedToOverriddenMemberInspection */
     #[Pure]
-    protected function __construct(string $message, int $code = 0, ?\Throwable $previous = null)
+    protected function __construct(string $message, int $code = 1, ?\Throwable $previous = null)
     {
         parent::__construct($message, $code, $previous);
     }

49) /var/www/html/src/Shared/Domain/DomainException.php:15    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     #[Pure]
     protected function __construct(string $message, int $code = 0, ?\Throwable $previous = null)
     {
-        parent::__construct($message, $code, $previous);
+        
     }
     public abstract function title() : string;
     #[Pure]

50) /var/www/html/src/Shared/Domain/DomainException.php:20    [M] PublicVisibility

--- Original
+++ New
@@ @@
         parent::__construct($message, $code, $previous);
     }
     public abstract function title() : string;
-    #[Pure]
-    public function detail() : string
+    protected function detail() : string
     {
         return $this->getMessage();
     }

51) /var/www/html/src/Shared/Domain/DomainException.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->getMessage();
     }
-    public function code() : string
+    protected function code() : string
     {
         return str_replace('_exception', '', Utils::toSnakeCase(Utils::extractClassName($this)));
     }
 }

52) /var/www/html/src/Shared/Domain/DomainException.php:28    [M] UnwrapStrReplace

--- Original
+++ New
@@ @@
     }
     public function code() : string
     {
-        return str_replace('_exception', '', Utils::toSnakeCase(Utils::extractClassName($this)));
+        return Utils::toSnakeCase(Utils::extractClassName($this));
     }
 }

53) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     private function __construct(MessageId $messageId, string $messageName, array $messageBody, string $aggregateId, \DateTimeInterface $occurredAt)
     {
-        $this->setMessageId($messageId);
+        
         $this->setMessageName($messageName);
         $this->setMessageBody($messageBody);
         $this->setAggregateId($aggregateId);

54) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function __construct(MessageId $messageId, string $messageName, array $messageBody, string $aggregateId, \DateTimeInterface $occurredAt)
     {
         $this->setMessageId($messageId);
-        $this->setMessageName($messageName);
+        
         $this->setMessageBody($messageBody);
         $this->setAggregateId($aggregateId);
         $this->setOccurredAt($occurredAt);

55) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->setMessageId($messageId);
         $this->setMessageName($messageName);
-        $this->setMessageBody($messageBody);
+        
         $this->setAggregateId($aggregateId);
         $this->setOccurredAt($occurredAt);
     }

56) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->setMessageId($messageId);
         $this->setMessageName($messageName);
         $this->setMessageBody($messageBody);
-        $this->setAggregateId($aggregateId);
+        
         $this->setOccurredAt($occurredAt);
     }
     /**

57) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->setMessageName($messageName);
         $this->setMessageBody($messageBody);
         $this->setAggregateId($aggregateId);
-        $this->setOccurredAt($occurredAt);
+        
     }
     /**
      * @param array<mixed> $messageBody

58) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @throws AssertionFailedException
      */
-    public static function create(MessageId $messageId, string $messageName, array $messageBody, string $aggregateId, \DateTimeInterface $occurredAt) : self
+    protected static function create(MessageId $messageId, string $messageName, array $messageBody, string $aggregateId, \DateTimeInterface $occurredAt) : self
     {
         return new self($messageId, $messageName, $messageBody, $aggregateId, $occurredAt);
     }

59) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self($messageId, $messageName, $messageBody, $aggregateId, $occurredAt);
     }
-    public function messageId() : MessageId
+    protected function messageId() : MessageId
     {
         return $this->messageId;
     }

60) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:66    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->messageId;
     }
-    public function messageName() : string
+    protected function messageName() : string
     {
         return $this->messageName;
     }

61) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->messageName;
     }
     /** @return array<mixed> */
-    public function messageBody() : array
+    protected function messageBody() : array
     {
         return $this->messageBody;
     }

62) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:77    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->messageBody;
     }
-    public function aggregateId() : string
+    protected function aggregateId() : string
     {
         return $this->aggregateId;
     }

63) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:82    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->aggregateId;
     }
-    public function occurredAt() : CarbonImmutable
+    protected function occurredAt() : CarbonImmutable
     {
         return $this->occurredAt;
     }

64) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:103    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     #[ArrayShape(['id' => "\\Whalar\\Shared\\Domain\\Event\\ValueObject\\MessageId", 'topic' => 'string', 'payload' => 'mixed', 'resourceId' => 'string', 'createdAt' => 'string'])]
     public function jsonSerialize() : array
     {
-        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
+        return ['topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
     }
     private function setMessageId(MessageId $messageId) : void
     {

65) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:104    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['id' => "\\Whalar\\Shared\\Domain\\Event\\ValueObject\\MessageId", 'topic' => 'string', 'payload' => 'mixed', 'resourceId' => 'string', 'createdAt' => 'string'])]
     public function jsonSerialize() : array
     {
-        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
+        return ['id' > $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
     }
     private function setMessageId(MessageId $messageId) : void
     {

66) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:105    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['id' => "\\Whalar\\Shared\\Domain\\Event\\ValueObject\\MessageId", 'topic' => 'string', 'payload' => 'mixed', 'resourceId' => 'string', 'createdAt' => 'string'])]
     public function jsonSerialize() : array
     {
-        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
+        return ['id' => $this->messageId(), 'topic' > $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
     }
     private function setMessageId(MessageId $messageId) : void
     {

67) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:106    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['id' => "\\Whalar\\Shared\\Domain\\Event\\ValueObject\\MessageId", 'topic' => 'string', 'payload' => 'mixed', 'resourceId' => 'string', 'createdAt' => 'string'])]
     public function jsonSerialize() : array
     {
-        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
+        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' > $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
     }
     private function setMessageId(MessageId $messageId) : void
     {

68) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:107    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['id' => "\\Whalar\\Shared\\Domain\\Event\\ValueObject\\MessageId", 'topic' => 'string', 'payload' => 'mixed', 'resourceId' => 'string', 'createdAt' => 'string'])]
     public function jsonSerialize() : array
     {
-        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
+        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' > $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
     }
     private function setMessageId(MessageId $messageId) : void
     {

69) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:108    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['id' => "\\Whalar\\Shared\\Domain\\Event\\ValueObject\\MessageId", 'topic' => 'string', 'payload' => 'mixed', 'resourceId' => 'string', 'createdAt' => 'string'])]
     public function jsonSerialize() : array
     {
-        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' => $this->occurredAt()->toIso8601ZuluString()];
+        return ['id' => $this->messageId(), 'topic' => $this->messageName(), 'payload' => $this->messageBody(), 'resourceId' => $this->aggregateId(), 'createdAt' > $this->occurredAt()->toIso8601ZuluString()];
     }
     private function setMessageId(MessageId $messageId) : void
     {

70) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setMessageName(string $messageName) : void
     {
-        Assertion::notBlank($messageName);
+        
         $this->messageName = trim($messageName);
     }
     /** @param array<mixed> $messageBody */

71) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:121    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     private function setMessageName(string $messageName) : void
     {
         Assertion::notBlank($messageName);
-        $this->messageName = trim($messageName);
+        $this->messageName = $messageName;
     }
     /** @param array<mixed> $messageBody */
     private function setMessageBody(array $messageBody) : void

72) /var/www/html/src/Shared/Domain/Event/Aggregate/StoredEvent.php:133    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setAggregateId(string $aggregateId) : void
     {
-        Assertion::uuid($aggregateId);
+        
         $this->aggregateId = $aggregateId;
     }
     private function setOccurredAt(\DateTimeInterface $occurredAt) : void

73) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->messageId = $messageId;
         $this->messageVersion = $messageVersion;
         $this->occurredOn = $occurredOn;
-        $this->setMessagePayload($messagePayload);
+        
     }
     /**
      * @param array<mixed> $messagePayload

74) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @throws \InvalidArgumentException
      */
-    public static final function create(string $messageId, int $messageVersion, \DateTimeInterface $occurredOn, array $messagePayload) : self
+    protected static final function create(string $messageId, int $messageVersion, \DateTimeInterface $occurredOn, array $messagePayload) : self
     {
         $message = new static($messageId, $messageVersion, $occurredOn, $messagePayload);
         $message->setupPayload();

75) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public static final function create(string $messageId, int $messageVersion, \DateTimeInterface $occurredOn, array $messagePayload) : self
     {
         $message = new static($messageId, $messageVersion, $occurredOn, $messagePayload);
-        $message->setupPayload();
+        
         return $message;
     }
     public function messageAggregateId() : string

76) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:65    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $message->setupPayload();
         return $message;
     }
-    public function messageAggregateId() : string
+    protected function messageAggregateId() : string
     {
         throw new RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }

77) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:67    [M] Throw_

--- Original
+++ New
@@ @@
     }
     public function messageAggregateId() : string
     {
-        throw new RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
+        new RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }
     public function messageAggregateName() : string
     {

78) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         throw new RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }
-    public function messageAggregateName() : string
+    protected function messageAggregateName() : string
     {
         throw new RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }

80) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:79    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         throw new RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }
-    public function messageId() : string
+    protected function messageId() : string
     {
         return $this->messageId;
     }

81) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:85    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->messageId;
     }
     /* @throws Throwable */
-    public static function messageName() : string
+    protected static function messageName() : string
     {
         $value = (new \ReflectionClass(static::class))->getShortName();
         if (!ctype_lower($value)) {

82) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:89    [M] LogicalNot

--- Original
+++ New
@@ @@
     public static function messageName() : string
     {
         $value = (new \ReflectionClass(static::class))->getShortName();
-        if (!ctype_lower($value)) {
+        if (ctype_lower($value)) {
             $value = preg_replace('/\\s+/u', '', $value) ?? '';
             $value = preg_replace('/(.)(?=[A-Z])/u', '$1_', $value) ?? '';
             $value = strtolower($value);

83) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:90    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $value = (new \ReflectionClass(static::class))->getShortName();
         if (!ctype_lower($value)) {
-            $value = preg_replace('/\\s+/u', '', $value) ?? '';
+            $value = '' ?? preg_replace('/\\s+/u', '', $value);
             $value = preg_replace('/(.)(?=[A-Z])/u', '$1_', $value) ?? '';
             $value = strtolower($value);
         }

84) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:91    [M] Coalesce

--- Original
+++ New
@@ @@
         $value = (new \ReflectionClass(static::class))->getShortName();
         if (!ctype_lower($value)) {
             $value = preg_replace('/\\s+/u', '', $value) ?? '';
-            $value = preg_replace('/(.)(?=[A-Z])/u', '$1_', $value) ?? '';
+            $value = '' ?? preg_replace('/(.)(?=[A-Z])/u', '$1_', $value);
             $value = strtolower($value);
         }
         return $value;

85) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:92    [M] UnwrapStrToLower

--- Original
+++ New
@@ @@
         if (!ctype_lower($value)) {
             $value = preg_replace('/\\s+/u', '', $value) ?? '';
             $value = preg_replace('/(.)(?=[A-Z])/u', '$1_', $value) ?? '';
-            $value = strtolower($value);
+            $value = $value;
         }
         return $value;
     }

86) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:99    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $value;
     }
     /* @throws Throwable */
-    public function messageDefinition() : string
+    protected function messageDefinition() : string
     {
         return AsyncApiChannel::from(self::BUSINESS_NAME, self::DEPARTMENT_NAME, $this->messageVersion, self::EVENT_TYPE, $this->messageAggregateName(), $this::messageName())->format();
     }

87) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:112    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return AsyncApiChannel::from(self::BUSINESS_NAME, self::DEPARTMENT_NAME, $this->messageVersion, self::EVENT_TYPE, $this->messageAggregateName(), $this::messageName())->format();
     }
     /** @return array<mixed> */
-    public function messagePayload() : array
+    protected function messagePayload() : array
     {
         return $this->messagePayload;
     }

88) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:117    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->messagePayload;
     }
-    public function occurredOn() : \DateTimeInterface
+    protected function occurredOn() : \DateTimeInterface
     {
         return $this->occurredOn;
     }

89) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:136    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => "\\DateTimeInterface"])]
     public function jsonSerialize() : array
     {
-        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
+        return ['message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
     }
     protected abstract function setupPayload() : void;
     /**

90) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:137    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => "\\DateTimeInterface"])]
     public function jsonSerialize() : array
     {
-        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
+        return ['message_id' > $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
     }
     protected abstract function setupPayload() : void;
     /**

91) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:138    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => "\\DateTimeInterface"])]
     public function jsonSerialize() : array
     {
-        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
+        return ['message_id' => $this->messageId(), 'message_name' > $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
     }
     protected abstract function setupPayload() : void;
     /**

92) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:139    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => "\\DateTimeInterface"])]
     public function jsonSerialize() : array
     {
-        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
+        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' > $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
     }
     protected abstract function setupPayload() : void;
     /**

93) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:140    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => "\\DateTimeInterface"])]
     public function jsonSerialize() : array
     {
-        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
+        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' > $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
     }
     protected abstract function setupPayload() : void;
     /**

94) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:141    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => "\\DateTimeInterface"])]
     public function jsonSerialize() : array
     {
-        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->occurredOn()];
+        return ['message_id' => $this->messageId(), 'message_name' => $this->messageDefinition(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->occurredOn()->getTimestamp(), 'occurred_on_in_atom' > $this->occurredOn()];
     }
     protected abstract function setupPayload() : void;
     /**

95) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:154    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     private function setMessagePayload(array $messagePayload) : void
     {
-        $this->ensureThatPayloadHasOnlyPrimitives($messagePayload);
+        
         $this->messagePayload = $messagePayload;
     }
     /**
