96) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:164    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
      */
     private function ensureThatPayloadHasOnlyPrimitives(array $payload, string $index = 'payload') : void
     {
-        array_walk($payload, function ($item, $currentIndex) use($index) : void {
-            $fieldName = "{$index}.{$currentIndex}";
-            $this->ensureThatValueIsPrimitive($item, $fieldName);
-        });
+        
     }
     /* @throws InvalidArgumentException */
     private function ensureThatValueIsPrimitive(mixed $value, string $fieldName) : void

97) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:169    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         array_walk($payload, function ($item, $currentIndex) use($index) : void {
             $fieldName = "{$index}.{$currentIndex}";
-            $this->ensureThatValueIsPrimitive($item, $fieldName);
+            
         });
     }
     /* @throws InvalidArgumentException */

98) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:180    [M] Throw_

--- Original
+++ New
@@ @@
     {
         if (\is_object($value)) {
             $message = sprintf('Provided "%s" is a invalid primitive.', $fieldName);
-            throw new \InvalidArgumentException($message, Assertion::INVALID_OBJECT);
+            new \InvalidArgumentException($message, Assertion::INVALID_OBJECT);
         }
     }
     /** @param class-string $fullClassName */

99) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:191    [M] UnwrapStrToLower

--- Original
+++ New
@@ @@
     {
         $className = explode('\\', $fullClassName);
         $nameSanitized = preg_replace('/[A-Z]([A-Z](?![a-z]))*/', '_$0', end($className));
-        return ltrim(strtolower("{$nameSanitized}"), '_');
+        return ltrim("{$nameSanitized}", '_');
     }
 }

100) /var/www/html/src/Shared/Domain/Event/DomainEvent.php:191    [M] UnwrapLtrim

--- Original
+++ New
@@ @@
     {
         $className = explode('\\', $fullClassName);
         $nameSanitized = preg_replace('/[A-Z]([A-Z](?![a-z]))*/', '_$0', end($className));
-        return ltrim(strtolower("{$nameSanitized}"), '_');
+        return strtolower("{$nameSanitized}");
     }
 }

101) /var/www/html/src/Shared/Domain/Event/Exception/StoredEventNotFoundException.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Whalar\Shared\Domain\Exception\Http\NotFoundException;
 final class StoredEventNotFoundException extends NotFoundException
 {
-    #[Pure]
-    public static function from(string $identifier) : self
+    protected static function from(string $identifier) : self
     {
         return new self(sprintf('Stored event %s not found.', $identifier));
     }
 }

102) /var/www/html/src/Shared/Domain/Event/ValueObject/MessageId.php:18    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(string $id)
     {
-        Assertion::uuid($id);
+        
         $this->id = $id;
     }
     /** @throws AssertionFailedException */

103) /var/www/html/src/Shared/Domain/Event/ValueObject/MessageId.php:23    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->id = $id;
     }
     /** @throws AssertionFailedException */
-    public static function from(string $messageId) : self
+    protected static function from(string $messageId) : self
     {
         return new self($messageId);
     }

104) /var/www/html/src/Shared/Domain/Event/ValueObject/MessageId.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id();
     }
-    public function id() : string
+    protected function id() : string
     {
         return $this->id;
     }

105) /var/www/html/src/Shared/Domain/Exception/InvalidContentTypeException.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Whalar\Shared\Domain\Exception\Http\BadRequestException;
 final class InvalidContentTypeException extends BadRequestException
 {
-    public static function from(string $type) : self
+    protected static function from(string $type) : self
     {
         return new self(sprintf('The content type of request should by %s', $type));
     }
 }

106) /var/www/html/src/Shared/Domain/Exception/InvalidDataMappingException.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Whalar\Shared\Domain\Exception\Http\BadRequestException;
 final class InvalidDataMappingException extends BadRequestException
 {
-    #[Pure]
-    public static function fromMissingKey(string $key, ?string $arrayName = null) : self
+    protected static function fromMissingKey(string $key, ?string $arrayName = null) : self
     {
         if (null === $arrayName) {
             return new self(sprintf('Expected array to have a key "%s".', $key));

107) /var/www/html/src/Shared/Domain/Exception/InvalidDataMappingException.php:15    [M] Identical

--- Original
+++ New
@@ @@
     #[Pure]
     public static function fromMissingKey(string $key, ?string $arrayName = null) : self
     {
-        if (null === $arrayName) {
+        if (null !== $arrayName) {
             return new self(sprintf('Expected array to have a key "%s".', $key));
         }
         return new self(sprintf('Expected array "%s" to have a key "%s".', $arrayName, $key));

108) /var/www/html/src/Shared/Domain/Exception/InvalidDataMappingException.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return new self(sprintf('Expected array "%s" to have a key "%s".', $arrayName, $key));
     }
-    #[Pure]
-    public static function fromNonScalar(string $key, ?string $arrayName = null) : self
+    protected static function fromNonScalar(string $key, ?string $arrayName = null) : self
     {
         if (null === $arrayName) {
             return new self(sprintf('Expected array key "%s" to have a scalar value.', $key));

110) /var/www/html/src/Shared/Domain/Exception/InvalidIntegerIdException.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Whalar\Shared\Domain\Exception\Http\BadRequestException;
 final class InvalidIntegerIdException extends BadRequestException
 {
-    public static function from() : self
+    protected static function from() : self
     {
         return new self('The id is invalid');
     }
 }

111) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(string $organization, string $service, int $messageVersion, string $messageType, string $resource, string $action)
     {
-        $this->setOrganization($organization);
+        
         $this->setService($service);
         $this->setMessageVersion($messageVersion);
         $this->setMessageType($messageType);

112) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function __construct(string $organization, string $service, int $messageVersion, string $messageType, string $resource, string $action)
     {
         $this->setOrganization($organization);
-        $this->setService($service);
+        
         $this->setMessageVersion($messageVersion);
         $this->setMessageType($messageType);
         $this->setResource($resource);

113) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->setOrganization($organization);
         $this->setService($service);
-        $this->setMessageVersion($messageVersion);
+        
         $this->setMessageType($messageType);
         $this->setResource($resource);
         $this->setAction($action);

114) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->setOrganization($organization);
         $this->setService($service);
         $this->setMessageVersion($messageVersion);
-        $this->setMessageType($messageType);
+        
         $this->setResource($resource);
         $this->setAction($action);
     }

115) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->setService($service);
         $this->setMessageVersion($messageVersion);
         $this->setMessageType($messageType);
-        $this->setResource($resource);
+        
         $this->setAction($action);
     }
     /** @throws AssertionFailedException */

116) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->setMessageVersion($messageVersion);
         $this->setMessageType($messageType);
         $this->setResource($resource);
-        $this->setAction($action);
+        
     }
     /** @throws AssertionFailedException */
     public static function from(string $organization, string $service, int $messageVersion, string $messageType, string $resource, string $action) : self

117) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->setAction($action);
     }
     /** @throws AssertionFailedException */
-    public static function from(string $organization, string $service, int $messageVersion, string $messageType, string $resource, string $action) : self
+    protected static function from(string $organization, string $service, int $messageVersion, string $messageType, string $resource, string $action) : self
     {
         return new self($organization, $service, $messageVersion, $messageType, $resource, $action);
     }

118) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:50    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return new self($organization, $service, $messageVersion, $messageType, $resource, $action);
     }
     /** @throws AssertionFailedException */
-    public static function fromString(string $string) : self
+    protected static function fromString(string $string) : self
     {
         [$businessName, $department, $version, $type, $aggregateName, $action] = explode('.', $string);
         return new self($businessName, $department, (int) $version, $type, $aggregateName, $action);

119) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:54    [M] CastInt

--- Original
+++ New
@@ @@
     public static function fromString(string $string) : self
     {
         [$businessName, $department, $version, $type, $aggregateName, $action] = explode('.', $string);
-        return new self($businessName, $department, (int) $version, $type, $aggregateName, $action);
+        return new self($businessName, $department, $version, $type, $aggregateName, $action);
     }
     public function organization() : string
     {

120) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:57    [M] PublicVisibility

--- Original
+++ New
@@ @@
         [$businessName, $department, $version, $type, $aggregateName, $action] = explode('.', $string);
         return new self($businessName, $department, (int) $version, $type, $aggregateName, $action);
     }
-    public function organization() : string
+    protected function organization() : string
     {
         return $this->organization;
     }

121) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->organization;
     }
-    public function service() : string
+    protected function service() : string
     {
         return $this->service;
     }

122) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->service;
     }
-    public function messageVersion() : int
+    protected function messageVersion() : int
     {
         return $this->messageVersion;
     }

123) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->messageVersion;
     }
-    public function messageType() : string
+    protected function messageType() : string
     {
         return $this->messageType;
     }

124) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:77    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->messageType;
     }
-    public function resource() : string
+    protected function resource() : string
     {
         return $this->resource;
     }

125) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:82    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->resource;
     }
-    public function action() : string
+    protected function action() : string
     {
         return $this->action;
     }

126) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:87    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->action;
     }
-    public function format() : string
+    protected function format() : string
     {
         return sprintf('%s.%s.%s.%s.%s.%s', $this->organization, $this->service, $this->messageVersion, $this->messageType, $this->resource, $this->action);
     }

127) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:109    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setOrganization(string $businessName) : void
     {
-        Assertion::notBlank($businessName);
+        
         $this->organization = trim($businessName);
     }
     /** @throws AssertionFailedException */

128) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:111    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     private function setOrganization(string $businessName) : void
     {
         Assertion::notBlank($businessName);
-        $this->organization = trim($businessName);
+        $this->organization = $businessName;
     }
     /** @throws AssertionFailedException */
     private function setService(string $department) : void

129) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:117    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setService(string $department) : void
     {
-        Assertion::notBlank($department);
+        
         $this->service = trim($department);
     }
     private function setMessageVersion(int $version) : void

130) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:119    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     private function setService(string $department) : void
     {
         Assertion::notBlank($department);
-        $this->service = trim($department);
+        $this->service = $department;
     }
     private function setMessageVersion(int $version) : void
     {

131) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:130    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setMessageType(string $type) : void
     {
-        Assertion::choice($type, ['domain_event', 'command', 'query']);
+        Assertion::choice($type, ['command', 'query']);
         $this->messageType = $type;
     }
     /** @throws AssertionFailedException */

132) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:130    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setMessageType(string $type) : void
     {
-        Assertion::choice($type, ['domain_event', 'command', 'query']);
+        
         $this->messageType = $type;
     }
     /** @throws AssertionFailedException */

133) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:138    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setResource(string $aggregateName) : void
     {
-        Assertion::notBlank($aggregateName);
+        
         $this->resource = trim($aggregateName);
     }
     /** @throws AssertionFailedException */

134) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:140    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     private function setResource(string $aggregateName) : void
     {
         Assertion::notBlank($aggregateName);
-        $this->resource = trim($aggregateName);
+        $this->resource = $aggregateName;
     }
     /** @throws AssertionFailedException */
     private function setAction(string $action) : void

135) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:146    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setAction(string $action) : void
     {
-        Assertion::notBlank($action);
+        
         $this->action = trim($action);
     }
 }

136) /var/www/html/src/Shared/Domain/Messaging/AsyncApi/AsyncApiChannel.php:148    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     private function setAction(string $action) : void
     {
         Assertion::notBlank($action);
-        $this->action = trim($action);
+        $this->action = $action;
     }
 }

138) /var/www/html/src/Shared/Domain/Messaging/Message.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private final function __construct(MessageId $messageId, array $payload, \DateTimeInterface $occurredOn)
     {
         $this->setMessageId($messageId);
-        $this->setMessagePayload($payload);
+        
         $this->setMessageOccurredOn($occurredOn);
     }
     /**

139) /var/www/html/src/Shared/Domain/Messaging/Message.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->setMessageId($messageId);
         $this->setMessagePayload($payload);
-        $this->setMessageOccurredOn($occurredOn);
+        
     }
     /**
      * @param array<string, mixed> $payload

140) /var/www/html/src/Shared/Domain/Messaging/Message.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return static
      */
-    public static final function fromPayload(MessageId $messageId, array $payload, ?\DateTimeInterface $occurredOn = null) : self
+    protected static final function fromPayload(MessageId $messageId, array $payload, ?\DateTimeInterface $occurredOn = null) : self
     {
         $message = new static($messageId, $payload, $occurredOn ?? CarbonImmutable::now('utc'));
         $message->assertPayload();

141) /var/www/html/src/Shared/Domain/Messaging/Message.php:60    [M] Coalesce

--- Original
+++ New
@@ @@
      */
     public static final function fromPayload(MessageId $messageId, array $payload, ?\DateTimeInterface $occurredOn = null) : self
     {
-        $message = new static($messageId, $payload, $occurredOn ?? CarbonImmutable::now('utc'));
+        $message = new static($messageId, $payload, CarbonImmutable::now('utc') ?? $occurredOn);
         $message->assertPayload();
         return $message;
     }

142) /var/www/html/src/Shared/Domain/Messaging/Message.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public static final function fromPayload(MessageId $messageId, array $payload, ?\DateTimeInterface $occurredOn = null) : self
     {
         $message = new static($messageId, $payload, $occurredOn ?? CarbonImmutable::now('utc'));
-        $message->assertPayload();
+        
         return $message;
     }
     public static function messageVersion() : int

143) /var/www/html/src/Shared/Domain/Messaging/Message.php:66    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $message->assertPayload();
         return $message;
     }
-    public static function messageVersion() : int
+    protected static function messageVersion() : int
     {
         throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }

144) /var/www/html/src/Shared/Domain/Messaging/Message.php:68    [M] Throw_

--- Original
+++ New
@@ @@
     }
     public static function messageVersion() : int
     {
-        throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
+        new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }
     public static function messageType() : string
     {

145) /var/www/html/src/Shared/Domain/Messaging/Message.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }
-    public static function messageType() : string
+    protected static function messageType() : string
     {
         throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }

147) /var/www/html/src/Shared/Domain/Messaging/Message.php:80    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }
-    public static function messageAggregate() : string
+    protected static function messageAggregate() : string
     {
         throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }

149) /var/www/html/src/Shared/Domain/Messaging/Message.php:87    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }
-    public static function messageAction() : string
+    protected static function messageAction() : string
     {
         throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }

151) /var/www/html/src/Shared/Domain/Messaging/Message.php:94    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         throw new \RuntimeException('This method acts as an abstract one, should be override and should not be called directly.');
     }
-    public static final function messageService() : string
+    protected static final function messageService() : string
     {
         $boundedContextNamespace = Str::of(static::class)->explode('\\')->slice(1)->first();
         $messageService = self::MESSAGE_SERVICE_MAP[$boundedContextNamespace] ?? null;

152) /var/www/html/src/Shared/Domain/Messaging/Message.php:96    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public static final function messageService() : string
     {
-        $boundedContextNamespace = Str::of(static::class)->explode('\\')->slice(1)->first();
+        $boundedContextNamespace = Str::of(static::class)->explode('\\')->slice(0)->first();
         $messageService = self::MESSAGE_SERVICE_MAP[$boundedContextNamespace] ?? null;
         if (null === $messageService) {
             throw new \LogicException('Message service mapping not found');

153) /var/www/html/src/Shared/Domain/Messaging/Message.php:96    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public static final function messageService() : string
     {
-        $boundedContextNamespace = Str::of(static::class)->explode('\\')->slice(1)->first();
+        $boundedContextNamespace = Str::of(static::class)->explode('\\')->slice(2)->first();
         $messageService = self::MESSAGE_SERVICE_MAP[$boundedContextNamespace] ?? null;
         if (null === $messageService) {
             throw new \LogicException('Message service mapping not found');

154) /var/www/html/src/Shared/Domain/Messaging/Message.php:100    [M] Identical

--- Original
+++ New
@@ @@
     {
         $boundedContextNamespace = Str::of(static::class)->explode('\\')->slice(1)->first();
         $messageService = self::MESSAGE_SERVICE_MAP[$boundedContextNamespace] ?? null;
-        if (null === $messageService) {
+        if (null !== $messageService) {
             throw new \LogicException('Message service mapping not found');
         }
         return $messageService;

155) /var/www/html/src/Shared/Domain/Messaging/Message.php:101    [M] Throw_

--- Original
+++ New
@@ @@
         $boundedContextNamespace = Str::of(static::class)->explode('\\')->slice(1)->first();
         $messageService = self::MESSAGE_SERVICE_MAP[$boundedContextNamespace] ?? null;
         if (null === $messageService) {
-            throw new \LogicException('Message service mapping not found');
+            new \LogicException('Message service mapping not found');
         }
         return $messageService;
     }

156) /var/www/html/src/Shared/Domain/Messaging/Message.php:108    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $messageService;
     }
     /** @throws AssertionFailedException */
-    public static final function messageChannel() : string
+    protected static final function messageChannel() : string
     {
         return AsyncApiChannel::from(self::BUSINESS, static::messageService(), static::messageVersion(), static::messageType(), static::messageAggregate(), static::messageAction())->format();
     }

157) /var/www/html/src/Shared/Domain/Messaging/Message.php:120    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return AsyncApiChannel::from(self::BUSINESS, static::messageService(), static::messageVersion(), static::messageType(), static::messageAggregate(), static::messageAction())->format();
     }
-    public final function messageId() : MessageId
+    protected final function messageId() : MessageId
     {
         return $this->messageId;
     }

158) /var/www/html/src/Shared/Domain/Messaging/Message.php:126    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->messageId;
     }
     /** @return array<mixed> */
-    public final function messagePayload() : array
+    protected final function messagePayload() : array
     {
         return $this->messagePayload;
     }

159) /var/www/html/src/Shared/Domain/Messaging/Message.php:131    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->messagePayload;
     }
-    public final function messageOccurredOn() : \DateTimeInterface
+    protected final function messageOccurredOn() : \DateTimeInterface
     {
         return $this->messageOccurredOn;
     }

160) /var/www/html/src/Shared/Domain/Messaging/Message.php:141    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @throws AssertionFailedException
      */
-    #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'array|mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => 'string'])]
-    public final function toArray() : array
+    protected final function toArray() : array
     {
         return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
     }

161) /var/www/html/src/Shared/Domain/Messaging/Message.php:150    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'array|mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => 'string'])]
     public final function toArray() : array
     {
-        return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
+        return ['message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
     }
     /**
      * @return array<mixed>

162) /var/www/html/src/Shared/Domain/Messaging/Message.php:151    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'array|mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => 'string'])]
     public final function toArray() : array
     {
-        return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
+        return ['message_id' > $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
     }
     /**
      * @return array<mixed>
