163) /var/www/html/src/Shared/Domain/Messaging/Message.php:153    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'array|mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => 'string'])]
     public final function toArray() : array
     {
-        return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
+        return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' > $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
     }
     /**
      * @return array<mixed>

164) /var/www/html/src/Shared/Domain/Messaging/Message.php:154    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'array|mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => 'string'])]
     public final function toArray() : array
     {
-        return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
+        return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' > $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
     }
     /**
      * @return array<mixed>

165) /var/www/html/src/Shared/Domain/Messaging/Message.php:155    [M] ArrayItem

--- Original
+++ New
@@ @@
     #[ArrayShape(['message_id' => 'string', 'message_name' => 'string', 'payload' => 'array|mixed', 'occurred_on_in_ms' => 'false|int', 'occurred_on_in_atom' => 'string'])]
     public final function toArray() : array
     {
-        return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' => $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
+        return ['message_id' => $this->messageId()->id(), 'message_name' => $this::messageChannel(), 'payload' => $this->messagePayload(), 'occurred_on_in_ms' => $this->messageOccurredOn()->getTimestamp(), 'occurred_on_in_atom' > $this->messageOccurredOn()->format(self::ISO8601_ZULU_MICROSECOND)];
     }
     /**
      * @return array<mixed>

166) /var/www/html/src/Shared/Domain/Messaging/Message.php:181    [M] CastString

--- Original
+++ New
@@ @@
     /** @param class-string $class */
     protected static final function messageAggregateFromClass(string $class) : string
     {
-        return (string) Str::of(class_basename($class))->snake();
+        return Str::of(class_basename($class))->snake();
     }
     private function setMessageId(MessageId $id) : void
     {

167) /var/www/html/src/Shared/Domain/Messaging/Message.php:192    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @param array<string, mixed> $payload */
     private function setMessagePayload(array $payload) : void
     {
-        $this->ensureThatPayloadHasOnlyPrimitives($payload);
+        
         $this->messagePayload = $payload;
     }
     private function setMessageOccurredOn(\DateTimeInterface $occurredOn) : void

170) /var/www/html/src/Shared/Domain/Messaging/Message.php:224    [M] Throw_

--- Original
+++ New
@@ @@
     {
         if (\is_object($value)) {
             $message = sprintf('Provided "%s" is an object. Payload parameters only can be primitive.', $fieldName);
-            throw new \InvalidArgumentException($message);
+            new \InvalidArgumentException($message);
         }
         if (true !== \is_array($value)) {
             return;

171) /var/www/html/src/Shared/Domain/Messaging/Message.php:227    [M] TrueValue

--- Original
+++ New
@@ @@
             $message = sprintf('Provided "%s" is an object. Payload parameters only can be primitive.', $fieldName);
             throw new \InvalidArgumentException($message);
         }
-        if (true !== \is_array($value)) {
+        if (false !== \is_array($value)) {
             return;
         }
         $this->ensureThatPayloadHasOnlyPrimitives($value, $fieldName);
     }
 }

172) /var/www/html/src/Shared/Domain/Messaging/Message.php:227    [M] NotIdentical

--- Original
+++ New
@@ @@
             $message = sprintf('Provided "%s" is an object. Payload parameters only can be primitive.', $fieldName);
             throw new \InvalidArgumentException($message);
         }
-        if (true !== \is_array($value)) {
+        if (true === \is_array($value)) {
             return;
         }
         $this->ensureThatPayloadHasOnlyPrimitives($value, $fieldName);
     }
 }

173) /var/www/html/src/Shared/Domain/Messaging/Message.php:231    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (true !== \is_array($value)) {
             return;
         }
-        $this->ensureThatPayloadHasOnlyPrimitives($value, $fieldName);
+        
     }
 }

174) /var/www/html/src/Shared/Domain/Messaging/Serialization/SerializationException.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Whalar\Shared\Domain\DomainException;
 final class SerializationException extends DomainException
 {
-    #[Pure]
-    public static function from(string $message, ?\Throwable $previous = null) : self
+    protected static function from(string $message, ?\Throwable $previous = null) : self
     {
         return new self($message, 0, $previous);
     }

175) /var/www/html/src/Shared/Domain/Messaging/Serialization/SerializationException.php:15    [M] DecrementInteger

--- Original
+++ New
@@ @@
     #[Pure]
     public static function from(string $message, ?\Throwable $previous = null) : self
     {
-        return new self($message, 0, $previous);
+        return new self($message, -1, $previous);
     }
     public function title() : string
     {

176) /var/www/html/src/Shared/Domain/Messaging/Serialization/SerializationException.php:15    [M] IncrementInteger

--- Original
+++ New
@@ @@
     #[Pure]
     public static function from(string $message, ?\Throwable $previous = null) : self
     {
-        return new self($message, 0, $previous);
+        return new self($message, 1, $previous);
     }
     public function title() : string
     {

177) /var/www/html/src/Shared/Domain/Utils.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Assert\Assert;
 final class Utils
 {
-    public static function extractClassName(mixed $objectOrClass) : string
+    protected static function extractClassName(mixed $objectOrClass) : string
     {
         Assert::that($objectOrClass)->objectOrClass();
         try {

178) /var/www/html/src/Shared/Domain/Utils.php:13    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public static function extractClassName(mixed $objectOrClass) : string
     {
-        Assert::that($objectOrClass)->objectOrClass();
+        
         try {
             $reflect = new \ReflectionClass($objectOrClass);
             return $reflect->getShortName();

179) /var/www/html/src/Shared/Domain/Utils.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
     }
     /** @return array<mixed> */
-    public static function jsonDecode(string $json) : array
+    protected static function jsonDecode(string $json) : array
     {
         $data = json_decode($json, true);
         if (\JSON_ERROR_NONE !== json_last_error()) {

180) /var/www/html/src/Shared/Domain/Utils.php:29    [M] NotIdentical

--- Original
+++ New
@@ @@
     public static function jsonDecode(string $json) : array
     {
         $data = json_decode($json, true);
-        if (\JSON_ERROR_NONE !== json_last_error()) {
+        if (\JSON_ERROR_NONE === json_last_error()) {
             throw new \RuntimeException('Unable to decode JSON string: ' . json_last_error_msg());
         }
         if (!\is_array($data)) {

181) /var/www/html/src/Shared/Domain/Utils.php:30    [M] Concat

--- Original
+++ New
@@ @@
     {
         $data = json_decode($json, true);
         if (\JSON_ERROR_NONE !== json_last_error()) {
-            throw new \RuntimeException('Unable to decode JSON string: ' . json_last_error_msg());
+            throw new \RuntimeException(json_last_error_msg() . 'Unable to decode JSON string: ');
         }
         if (!\is_array($data)) {
             throw new \RuntimeException('Unable to convert decoded JSON to array.');

182) /var/www/html/src/Shared/Domain/Utils.php:30    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $data = json_decode($json, true);
         if (\JSON_ERROR_NONE !== json_last_error()) {
-            throw new \RuntimeException('Unable to decode JSON string: ' . json_last_error_msg());
+            throw new \RuntimeException(json_last_error_msg());
         }
         if (!\is_array($data)) {
             throw new \RuntimeException('Unable to convert decoded JSON to array.');

183) /var/www/html/src/Shared/Domain/Utils.php:30    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $data = json_decode($json, true);
         if (\JSON_ERROR_NONE !== json_last_error()) {
-            throw new \RuntimeException('Unable to decode JSON string: ' . json_last_error_msg());
+            throw new \RuntimeException('Unable to decode JSON string: ');
         }
         if (!\is_array($data)) {
             throw new \RuntimeException('Unable to convert decoded JSON to array.');

184) /var/www/html/src/Shared/Domain/Utils.php:30    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $data = json_decode($json, true);
         if (\JSON_ERROR_NONE !== json_last_error()) {
-            throw new \RuntimeException('Unable to decode JSON string: ' . json_last_error_msg());
+            new \RuntimeException('Unable to decode JSON string: ' . json_last_error_msg());
         }
         if (!\is_array($data)) {
             throw new \RuntimeException('Unable to convert decoded JSON to array.');

185) /var/www/html/src/Shared/Domain/Utils.php:33    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (\JSON_ERROR_NONE !== json_last_error()) {
             throw new \RuntimeException('Unable to decode JSON string: ' . json_last_error_msg());
         }
-        if (!\is_array($data)) {
+        if (\is_array($data)) {
             throw new \RuntimeException('Unable to convert decoded JSON to array.');
         }
         return $data;

186) /var/www/html/src/Shared/Domain/Utils.php:34    [M] Throw_

--- Original
+++ New
@@ @@
             throw new \RuntimeException('Unable to decode JSON string: ' . json_last_error_msg());
         }
         if (!\is_array($data)) {
-            throw new \RuntimeException('Unable to convert decoded JSON to array.');
+            new \RuntimeException('Unable to convert decoded JSON to array.');
         }
         return $data;
     }

188) /var/www/html/src/Shared/Domain/Utils.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $data;
     }
     /** @param array<mixed> $data */
-    public static function jsonEncode(array $data) : string
+    protected static function jsonEncode(array $data) : string
     {
         $json = json_encode($data);
         if (false === $json) {

189) /var/www/html/src/Shared/Domain/Utils.php:45    [M] FalseValue

--- Original
+++ New
@@ @@
     public static function jsonEncode(array $data) : string
     {
         $json = json_encode($data);
-        if (false === $json) {
+        if (true === $json) {
             throw new \RuntimeException('Unable to encode JSON: ' . json_last_error_msg());
         }
         return $json;

190) /var/www/html/src/Shared/Domain/Utils.php:45    [M] Identical

--- Original
+++ New
@@ @@
     public static function jsonEncode(array $data) : string
     {
         $json = json_encode($data);
-        if (false === $json) {
+        if (false !== $json) {
             throw new \RuntimeException('Unable to encode JSON: ' . json_last_error_msg());
         }
         return $json;

191) /var/www/html/src/Shared/Domain/Utils.php:46    [M] Concat

--- Original
+++ New
@@ @@
     {
         $json = json_encode($data);
         if (false === $json) {
-            throw new \RuntimeException('Unable to encode JSON: ' . json_last_error_msg());
+            throw new \RuntimeException(json_last_error_msg() . 'Unable to encode JSON: ');
         }
         return $json;
     }

192) /var/www/html/src/Shared/Domain/Utils.php:46    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $json = json_encode($data);
         if (false === $json) {
-            throw new \RuntimeException('Unable to encode JSON: ' . json_last_error_msg());
+            throw new \RuntimeException(json_last_error_msg());
         }
         return $json;
     }

193) /var/www/html/src/Shared/Domain/Utils.php:46    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $json = json_encode($data);
         if (false === $json) {
-            throw new \RuntimeException('Unable to encode JSON: ' . json_last_error_msg());
+            throw new \RuntimeException('Unable to encode JSON: ');
         }
         return $json;
     }

194) /var/www/html/src/Shared/Domain/Utils.php:46    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $json = json_encode($data);
         if (false === $json) {
-            throw new \RuntimeException('Unable to encode JSON: ' . json_last_error_msg());
+            new \RuntimeException('Unable to encode JSON: ' . json_last_error_msg());
         }
         return $json;
     }

195) /var/www/html/src/Shared/Domain/Utils.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $json;
     }
-    public static function toSnakeCase(string $text) : string
+    protected static function toSnakeCase(string $text) : string
     {
         return ctype_lower($text) ? $text : strtolower(preg_replace('/([^A-Z\\s])([A-Z])/', '$1_$2', $text) ?? '');
     }
 }

196) /var/www/html/src/Shared/Domain/Utils.php:54    [M] Ternary

--- Original
+++ New
@@ @@
     }
     public static function toSnakeCase(string $text) : string
     {
-        return ctype_lower($text) ? $text : strtolower(preg_replace('/([^A-Z\\s])([A-Z])/', '$1_$2', $text) ?? '');
+        return ctype_lower($text) ? strtolower(preg_replace('/([^A-Z\\s])([A-Z])/', '$1_$2', $text) ?? '') : $text;
     }
 }

197) /var/www/html/src/Shared/Domain/Utils.php:56    [M] Coalesce

--- Original
+++ New
@@ @@
     }
     public static function toSnakeCase(string $text) : string
     {
-        return ctype_lower($text) ? $text : strtolower(preg_replace('/([^A-Z\\s])([A-Z])/', '$1_$2', $text) ?? '');
+        return ctype_lower($text) ? $text : strtolower('' ?? preg_replace('/([^A-Z\\s])([A-Z])/', '$1_$2', $text));
     }
 }

198) /var/www/html/src/Shared/Domain/Utils.php:56    [M] UnwrapStrToLower

--- Original
+++ New
@@ @@
     }
     public static function toSnakeCase(string $text) : string
     {
-        return ctype_lower($text) ? $text : strtolower(preg_replace('/([^A-Z\\s])([A-Z])/', '$1_$2', $text) ?? '');
+        return ctype_lower($text) ? $text : preg_replace('/([^A-Z\\s])([A-Z])/', '$1_$2', $text) ?? '';
     }
 }

199) /var/www/html/src/Shared/Domain/ValueObject/AggregateId.php:18    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(string $value)
     {
-        $this->setValue($value);
+        
     }
     /** @throws AssertionFailedException */
     public static function from(string $value) : self

200) /var/www/html/src/Shared/Domain/ValueObject/AggregateId.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->setValue($value);
     }
     /** @throws AssertionFailedException */
-    public static function from(string $value) : self
+    protected static function from(string $value) : self
     {
         return new self($value);
     }

201) /var/www/html/src/Shared/Domain/ValueObject/AggregateId.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return new self($value);
     }
     /** @throws AssertionFailedException */
-    public static function random() : self
+    protected static function random() : self
     {
         return new self(Uuid::v4()->toRfc4122());
     }

203) /var/www/html/src/Shared/Domain/ValueObject/AggregateId.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->value;
     }
-    public function equalsTo(self $other) : bool
+    protected function equalsTo(self $other) : bool
     {
         return $this->id() === $other->id();
     }

204) /var/www/html/src/Shared/Domain/ValueObject/AggregateId.php:40    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function equalsTo(self $other) : bool
     {
-        return $this->id() === $other->id();
+        return $this->id() !== $other->id();
     }
     public function jsonSerialize() : string
     {

205) /var/www/html/src/Shared/Domain/ValueObject/AggregateId.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function setValue(string $value) : void
     {
-        Assertion::uuid($value);
+        
         $this->value = $value;
     }
 }

206) /var/www/html/src/Shared/Domain/ValueObject/ImageUrl.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private function __construct(private readonly string $imageUrl)
     {
     }
-    public static function from(string $imageUrl) : self
+    protected static function from(string $imageUrl) : self
     {
         Assertion::url($imageUrl);
         return new self($imageUrl);

207) /var/www/html/src/Shared/Domain/ValueObject/ImageUrl.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public static function from(string $imageUrl) : self
     {
-        Assertion::url($imageUrl);
+        
         return new self($imageUrl);
     }
     public function value() : string

208) /var/www/html/src/Shared/Domain/ValueObject/ImageUrl.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Assertion::url($imageUrl);
         return new self($imageUrl);
     }
-    public function value() : string
+    protected function value() : string
     {
         return $this->imageUrl;
     }

209) /var/www/html/src/Shared/Domain/ValueObject/Name.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
     }
     /** @throws AssertionFailedException */
-    public static function from(string $name) : self
+    protected static function from(string $name) : self
     {
         Assertion::lessThan(3, strlen($name));
         return new self($name);

210) /var/www/html/src/Shared/Domain/ValueObject/Name.php:19    [M] DecrementInteger

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     public static function from(string $name) : self
     {
-        Assertion::lessThan(3, strlen($name));
+        Assertion::lessThan(2, strlen($name));
         return new self($name);
     }
     public function value() : string

211) /var/www/html/src/Shared/Domain/ValueObject/Name.php:19    [M] IncrementInteger

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     public static function from(string $name) : self
     {
-        Assertion::lessThan(3, strlen($name));
+        Assertion::lessThan(4, strlen($name));
         return new self($name);
     }
     public function value() : string

212) /var/www/html/src/Shared/Domain/ValueObject/Name.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     public static function from(string $name) : self
     {
-        Assertion::lessThan(3, strlen($name));
+        
         return new self($name);
     }
     public function value() : string

214) /var/www/html/src/Shared/Domain/ValueObject/PaginatorPage.php:17    [M] DecrementInteger

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(int $page)
     {
-        Assertion::greaterThan($page, 0, 'Page must be greater than zero');
+        Assertion::greaterThan($page, -1, 'Page must be greater than zero');
         $this->page = $page;
     }
     /** @throws AssertionFailedException */

215) /var/www/html/src/Shared/Domain/ValueObject/PaginatorPage.php:17    [M] IncrementInteger

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(int $page)
     {
-        Assertion::greaterThan($page, 0, 'Page must be greater than zero');
+        Assertion::greaterThan($page, 1, 'Page must be greater than zero');
         $this->page = $page;
     }
     /** @throws AssertionFailedException */

216) /var/www/html/src/Shared/Domain/ValueObject/PaginatorPage.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(int $page)
     {
-        Assertion::greaterThan($page, 0, 'Page must be greater than zero');
+        
         $this->page = $page;
     }
     /** @throws AssertionFailedException */

217) /var/www/html/src/Shared/Domain/ValueObject/PaginatorPage.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->page = $page;
     }
     /** @throws AssertionFailedException */
-    public static function from(int $page) : self
+    protected static function from(int $page) : self
     {
         return new self($page);
     }

218) /var/www/html/src/Shared/Domain/ValueObject/PaginatorPage.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self($page);
     }
-    public function value() : int
+    protected function value() : int
     {
         return $this->page;
     }
 }

219) /var/www/html/src/Shared/Domain/ValueObject/PaginatorSize.php:17    [M] DecrementInteger

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(int $size)
     {
-        Assertion::greaterThan($size, 0, 'Size must be greater than zero');
+        Assertion::greaterThan($size, -1, 'Size must be greater than zero');
         $this->size = $size;
     }
     /** @throws AssertionFailedException */

220) /var/www/html/src/Shared/Domain/ValueObject/PaginatorSize.php:17    [M] IncrementInteger

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(int $size)
     {
-        Assertion::greaterThan($size, 0, 'Size must be greater than zero');
+        Assertion::greaterThan($size, 1, 'Size must be greater than zero');
         $this->size = $size;
     }
     /** @throws AssertionFailedException */

221) /var/www/html/src/Shared/Domain/ValueObject/PaginatorSize.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @throws AssertionFailedException */
     private function __construct(int $size)
     {
-        Assertion::greaterThan($size, 0, 'Size must be greater than zero');
+        
         $this->size = $size;
     }
     /** @throws AssertionFailedException */

222) /var/www/html/src/Shared/Domain/ValueObject/PaginatorSize.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->size = $size;
     }
     /** @throws AssertionFailedException */
-    public static function from(int $size) : self
+    protected static function from(int $size) : self
     {
         return new self($size);
     }
